app/views/users/feed.html.haml

      - @followees.each do |followee|
        -followee.posts.order('created_at DESC').each do |post|
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY created_at DESC  [["user_id", 3]]