app/views/users/feed.html.haml

        %td
          - if post.user_likes.include?(@user)
---
SELECT "users".* FROM "users" INNER JOIN "likes" ON "users"."id" = "likes"."user_id" WHERE "likes"."post_id" = ?  [["post_id", 9]]
SELECT 1 AS one FROM "users" INNER JOIN "likes" ON "users"."id" = "likes"."user_id" WHERE "likes"."post_id" = ? AND "users"."id" = ? LIMIT ?  [["post_id", 9], ["id", 4], ["LIMIT", 1]]

            = button_to "Like", like_post_path(post.id) , method: "POST" ,class:"btn btn-secondary  like-btn mt-2"
          - if post.likes.count != 0
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 9]]

              -#----------------number of like------------------
              = post.likes.count.to_s + " Likes"
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 9]]

                  .modal-body
                    - post.user_likes.each do |user|
---
SELECT "users".* FROM "users" INNER JOIN "likes" ON "users"."id" = "likes"."user_id" WHERE "likes"."post_id" = ?  [["post_id", 9]]