app/views/users/profile.html.haml

%br
- @user.posts.each do |post|
  .card.mt-4{:style => "width: 50vw;"}
    .card-body.cardPost
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 4]]

      %br
      - if post.user_likes.include?(@current_user)
---
SELECT "users".* FROM "users" INNER JOIN "likes" ON "users"."id" = "likes"."user_id" WHERE "likes"."post_id" = ?  [["post_id", 2]]
SELECT 1 AS one FROM "users" INNER JOIN "likes" ON "users"."id" = "likes"."user_id" WHERE "likes"."post_id" = ? AND "users"."id" = ? LIMIT ?  [["post_id", 2], ["id", 4], ["LIMIT", 1]]

        = button_to "Like", like_post_path(post.id) , method: "POST" ,class:"btn btn-secondary  like-btn mt-2"
      - if post.likes.count != 0
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 2]]

          -#----------------number of like------------------
          = post.likes.count.to_s + " Likes"
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 2]]

              .modal-body
                - post.user_likes.each do |user|
---
SELECT "users".* FROM "users" INNER JOIN "likes" ON "users"."id" = "likes"."user_id" WHERE "likes"."post_id" = ?  [["post_id", 2]]