app/controllers/posts_controller.rb

  def unlike
    Like.find_by(post_id:params[:post_id] ,user_id:session[:user_id]).destroy
---
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ? AND "likes"."user_id" = ? LIMIT ?  [["post_id", 9], ["user_id", 4], ["LIMIT", 1]]

  def like
    Like.create(post_id:params[:post_id] ,user_id:session[:user_id])
---
INSERT INTO "likes" ("post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 9], ["user_id", 4], ["created_at", "2021-10-24 08:08:19.414018"], ["updated_at", "2021-10-24 08:08:19.414018"]]

  def new
    @post = Post.new
    @user = User.find_by(id:session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def create
    @post = Post.new(post_params)
    @post.user_id = session[:user_id]

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("msg", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["msg", "xx"], ["user_id", 1], ["created_at", "2021-10-13 08:15:39.261124"], ["updated_at", "2021-10-13 08:15:39.261124"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "msg" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["msg", "kk"], ["updated_at", "2021-10-13 08:15:50.641807"], ["id", 1]]