app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user_id = session[:user_id]

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("msg", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["msg", "aa"], ["user_id", 4], ["created_at", "2021-10-14 05:22:01.927078"], ["updated_at", "2021-10-14 05:22:01.927078"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "msg" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["msg", "kk"], ["updated_at", "2021-10-13 08:15:50.641807"], ["id", 1]]