app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "x"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "x"], ["LIMIT", 1]]
---
  def checklog
    @email=params[:email]
    @pass=params[:password]
    @user = User.find_by({email:@email})
    if @user.present? && @user.authenticate(@pass)
      redirect_to feed_url , notice: "login successfully"
      session[:user_id]=User.find_by({email:@email}).id

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def feed
    @user = User.find_by(id:session[:user_id])

SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "a"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY created_at DESC  [["user_id", 4]]
---
  def profile
    @user = User.find_by(name:params[:name])
    @current_user = User.find_by(id:session[:user_id])
    @posts = @user.posts.order('created_at DESC')

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "users" ("email", "name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
INSERT INTO "follows" ("follower_id", "followee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 4], ["followee_id", 6], ["created_at", "2021-10-24 07:04:51.734964"], ["updated_at", "2021-10-24 07:04:51.734964"]]
---
  def follow
    @user = User.find(params[:id])
    @current_user = User.find_by(id:session[:user_id])
    @current_user.followees << @user

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "follows" WHERE "follows"."id" = ?  [["id", 4]]
---
  def unfollow
    @user = User.find(params[:id])
    @current_user = User.find_by(id:session[:user_id])
    @current_user.followed_users.find_by(followee_id: @user.id).destroy

INSERT INTO "users" ("email", "name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "b"], ["password_digest", "$2a$12$bh2SflRmMNA8yy7AJVhaWu/EecREXOLiJLoDzZVtkjzLiQbbVKzB2"], ["updated_at", "2021-10-13 13:46:10.028490"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)