app/models/user.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 3]]
---
    def get_feed_post
       posts = []
       self.followees.each do |f|
         f.posts.each do |p|